Revit 2027 API
ScheduleField.GridColumnWidth Property
 The width of the column in the editable grid view, measured in feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GridColumnWidth { get; set; }
Public Property GridColumnWidth As Double
	Get
	Set
public:
property double GridColumnWidth {
	double get ();
	void set (double value);
}
member GridColumnWidth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: gridColumnWidth is negative.
Remarks
In a schedule with an embedded ScheduleDefinition, a column may display two fields, one from each ScheduleDefinition. In that case, the larger of the two widths is used.
It is always aligned with the SheetColumnWidth.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace